/* По данному трехзначному числу определить, все ли его цифры различны.

Формат входных данных
На вход подается одно натуральное трехзначное число.

Формат выходных данных
Вывести "YES", если все цифры числа различны, в противном случае - "NO". */

package main

import (
	"fmt"
)

//(i % 10) - еденицы
//((i % 100) / 10) - десятки
//(i / 100) - сотни

/*
func main() {
	var i int
	fmt.Scan(&i)
	switch {
	case ((i % 10) != ((i % 100) / 10)) && (((i%100)/10) != (i/100) && ((i / 100) != (i % 10))):
		fmt.Println("YES")
	default:
		fmt.Println("NO")
	}
}
*/

func main() {
	var i int
	fmt.Scan(&i)
	if ((i % 10) != ((i % 100) / 10)) && (((i % 100) / 10) != (i / 100)) && ((i / 100) != (i % 10)) {
		fmt.Println("YES")
	} else {
		fmt.Println("NO")
	}
}
